import TreeMenu from './TreeMenu.vue'

let tree = {
  label: 'A СРЕДСТВА, ВЛИЯЮЩИЕ НА ПИЩЕВАРИТЕЛЬНУЮ СИСТЕМУ И МЕТАБОЛИЗМ',
  nodes: [
    {
      label: 'A01 СРЕДСТВА ДЛЯ ПРИМЕНЕНИЯ В СТОМАТОЛОГИИ',    
    },
    {
    	label: 'A02 ПРЕПАРАТЫ ДЛЯ ЛЕЧЕНИЯ КИСЛОТОЗАВИСИМЫХ ЗАБОЛЕВАНИЙ',
    },
    {
    	label: 'A03 СРЕДСТВА, ПРИМЕНЯЕМЫЕ ПРИ ФУНКЦИОНАЛЬНЫХ ЖЕЛУДОЧНО-КИШЕЧНЫХ РАССТРОЙСТВАХ'
    }
    ]
}

let tree = {
  label: 'B СРЕДСТВА, ВЛИЯЮЩИЕ НА СИСТЕМУ КРОВИ И ГЕМОПОЭЗ',
  nodes: [
    {
      label: 'B01 АНТИТРОМБОТИЧЕСКИЕ СРЕДСТВА',    
    },
    {
    	label: 'B02 АНТИГЕМОРРАГИЧЕСКИЕ СРЕДСТВА',
    },
    {
    	label: 'B02 АНТИГЕМОРРАГИЧЕСКИЕ СРЕДСТВА'
    }
    ]
}

let tree = {
  label: 'C СРЕДСТВА, ВЛИЯЮЩИЕ НА СЕРДЕЧНО-СОСУДИСТУЮ СИСТЕМУ',
  nodes: [
    {
      label: 'C01 КАРДИОЛОГИЧЕСКИЕ ПРЕПАРАТЫ',    
    },
    {
    	label: 'C02 ГИПОТЕНЗИВНЫЕ СРЕДСТВА',
    },
    {
    	label: 'C03 МОЧЕГОННЫЕ ПРЕПАРАТЫ'
    }
    ]
}

let tree = {
  label: 'D ДЕРМАТОЛОГИЧЕСКИЕ СРЕДСТВА',
  nodes: [
    {
      label: 'D01 ПРОТИВОГРИБКОВЫЕ ПРЕПАРАТЫ ДЛЯ ПРИМЕНЕНИЯ В ДЕРМАТОЛОГИИ',    
    },
    {
    	label: 'D02 ПРЕПАРАТЫ СО СМЯГЧАЮЩИМ И ЗАЩИТНЫМ ДЕЙСТВИЕМ',
    },
    {
    	label: 'D03 СРЕДСТВА ДЛЯ ЛЕЧЕНИЯ РАН И ЯЗВЕННЫХ ПОРАЖЕНИЙ'
    }
    ]
}

let tree = {
  label: 'G СРЕДСТВА, ВЛИЯЮЩИЕ НА МОЧЕПОЛОВУЮ СИСТЕМУ И ПОЛОВЫЕ ГОРМОНЫ',
  nodes: [
    {
      label: 'G01 ПРОТИВОМИКРОБНЫЕ И АНТИСЕПТИЧЕСКИЕ СРЕДСТВА, ПРИМЕНЯЕМЫЕ В ГИНЕКОЛОГИИ',    
    },
    {
    	label: 'G02 ПРОЧИЕ ГИНЕКОЛОГИЧЕСКИЕ СРЕДСТВА',
    },
    {
    	label: 'G03 ГОРМОНЫ ПОЛОВЫХ ЖЕЛЕЗ И ПРЕПАРАТЫ, ПРИМЕНЯЕМЫЕ ПРИ ПАТОЛОГИИ ПОЛОВОЙ СФЕРЫ'
    }
    ]
}

let tree = {
  label: 'H ПРЕПАРАТЫ ГОРМОНОВ ДЛЯ СИСТЕМНОГО ПРИМЕНЕНИЯ (КРОМЕ ПОЛОВЫХ ГОРМОНОВ И ИНСУЛИНОВ)',
  nodes: [
    {
      label: 'H01 ГИПОФИЗАРНЫЕ, ГИПОТАЛАМИЧЕСКИЕ ГОРМОНЫ И ИХ АНАЛОГИ',    
    },
    {
    	label: 'H02 КОРТИКОСТЕРОИДЫ ДЛЯ СИСТЕМНОГО ПРИМЕНЕНИЯ',
    },
    {
    	label: 'H03 ТИРЕОТРОПНЫЕ СРЕДСТВА'
    }
    ]
}

let tree = {
  label: 'J ПРОТИВОМИКРОБНЫЕ СРЕДСТВА ДЛЯ СИСТЕМНОГО ПРИМЕНЕНИЯ',
  nodes: [
    {
      label: 'J01 АНТИБАКТЕРИАЛЬНЫЕ СРЕДСТВА ДЛЯ СИСТЕМНОГО ПРИМЕНЕНИЯ',    
    },
    {
    	label: 'J02 ПРОТИВОГРИБКОВЫЕ СРЕДСТВА ДЛЯ СИСТЕМНОГО ПРИМЕНЕНИЯ',
    },
    {
    	label: 'J04 СРЕДСТВА, ДЕЙСТВУЮЩИЕ НА МИКОБАКТЕРИИ'
    }
    ]
}

let tree = {
  label: 'L АНТИНЕОПЛАСТИЧЕСКИЕ И ИММУНОМОДУЛИРУЮЩИЕ СРЕДСТВА',
  nodes: [
    {
      label: 'L01 АНТИНЕОПЛАСТИЧЕСКИЕ СРЕДСТВА',    
    },
    {
    	label: 'L02 СРЕДСТВА, ПРИМЕНЯЕМЫЕ ДЛЯ ГОРМОНАЛЬНОЙ ТЕРАПИИ',
    },
    {
    	label: 'L03 ИММУНОСТИМУЛЯТОРЫ'
    }
    ]
}

let tree = {
  label: 'M СРЕДСТВА, ВЛИЯЮЩИЕ НА ОПОРНО-ДВИГАТЕЛЬНЫЙ АППАРАТ',
  nodes: [
    {
      label: 'M01 ПРОТИВОВОСПАЛИТЕЛЬНЫЕ И ПРОТИВОРЕВМАТИЧЕСКИЕ СРЕДСТВА',    
    },
    {
    	label: 'M02 СРЕДСТВА, ПРИМЕНЯЕМЫЕ МЕСТНО ПРИ СУСТАВНОЙ И МЫШЕЧНОЙ БОЛИ',
    },
    {
    	label: 'M03 МИОРЕЛАКСАНТЫ'
    }
    ]
}

let tree = {
  label: 'N СРЕДСТВА, ДЕЙСТВУЮЩИЕ НА НЕРВНУЮ СИСТЕМУ',
  nodes: [
    {
      label: 'N01 АНЕСТЕТИКИ',    
    },
    {
    	label: 'N02 АНАЛЬГЕТИКИ',
    },
    {
    	label: 'N03 ПРОТИВОЭПИЛЕПТИЧЕСКИЕ СРЕДСТВА'
    }
    ]
}

let tree = {
  label: 'P ПРОТИВОПАРАЗИТАРНЫЕ СРЕДСТВА, ИНСЕКТИЦИДЫ И РЕПЕЛЛЕНТЫ',
  nodes: [
    {
      label: 'P01 АНТИПРОТОЗОЙНЫЕ ПРЕПАРАТЫ',    
    },
    {
    	label: 'P02 ПРОТИВОГЕЛЬМИНТНЫЕ СРЕДСТВА',
    },
    {
    	label: 'P03 СРЕДСТВА, ДЕЙСТВУЮЩИЕ НА ЭКТОПАРАЗИТОВ, ВКЛЮЧАЯ ПРЕПАРАТЫ, ПРИМЕНЯЕМЫЕ ПРИ ЧЕСОТКЕ, И РЕПЕЛЛЕНТЫ'
    }
    ]
}

let tree = {
  label: 'R СРЕДСТВА, ДЕЙСТВУЮЩИЕ НА РЕСПИРАТОРНУЮ СИСТЕМУ',
  nodes: [
    {
      label: 'R01 СРЕДСТВА, ПРИМЕНЯЕМЫЕ ПРИ ЗАБОЛЕВАНИЯХ ПОЛОСТИ НОСА',    
    },
    {
    	label: 'R02 ПРЕПАРАТЫ, ПРИМЕНЯЕМЫЕ ПРИ ЗАБОЛЕВАНИЯХ ГОРЛА',
    },
    {
    	label: 'R03 СРЕДСТВА, ПРИМЕНЯЕМЫЕ ПРИ ОБСТРУКТИВНЫХ ЗАБОЛЕВАНИЯХ ДЫХАТЕЛЬНЫХ ПУТЕЙ'
    }
    ]
}

let tree = {
  label: 'S СРЕДСТВА, ДЕЙСТВУЮЩИЕ НА ОРГАНЫ ЧУВСТВ',
  nodes: [
    {
      label: 'S01 СРЕДСТВА, ПРИМЕНЯЕМЫЕ В ОФТАЛЬМОЛОГИИ',    
    },
    {
    	label: 'S02 ПРЕПАРАТЫ, ПРИМЕНЯЕМЫЕ В ОТОЛОГИИ',
    },
    {
    	label: 'S03 ПРЕПАРАТЫ, ПРИМЕНЯЕМЫЕ В ОФТАЛЬМОЛОГИИ И ОТОЛОГИИ'
    }
    ]
}

let tree = {
  label: 'V РАЗЛИЧНЫЕ СРЕДСТВА',
  nodes: [
    {
      label: 'V03 ВСЕ ПРОЧИЕ ЛЕКАРСТВЕННЫЕ СРЕДСТВА',    
    },
    {
    	label: 'V04 ДИАГНОСТИЧЕСКИЕ СРЕДСТВА',
    },
    {
    	label: 'V06 ПИТАТЕЛЬНЫЕ ПРОДУКТЫ ОБЩЕГО НАЗНАЧЕНИЯ'
    }
    ]
}


Vue.component('tree-menu', { 
  template: '#tree-menu',
  props: [ 'nodes', 'label', 'depth' ],
  data() {
     return {
       showChildren: false
     }
  },
  computed: {
    iconClasses() {
      return {
        'fa-plus-square-o': !this.showChildren,
        'fa-minus-square-o': this.showChildren
      }
    },
    labelClasses() {
      return { 'has-children': this.nodes }
    },
    indent() {
      return { transform: `translate(${this.depth * 50}px)` }
    }
  },
  methods: {
    toggleChildren() {
       this.showChildren = !this.showChildren;
    }
  }
});

new Vue({
  el: '#app',
  data: {
    tree
  },
  components: {
    TreeMenu
  }
})

Vue.filter('formatDate', function(d) {
	if(!window.Intl) return d;
	return new Intl.DateTimeFormat('en-US').format(new Date(d));
}); 


new Vue({
	el:'#app',
	data:{
		term:'',
		results:[],
		noResults:false,
		searching:false
	},
	methods:{
		search:function() {
			this.searching = true;
			fetch(`https://compendium.com.ua/atc/term=${encodeURIComponent(this.term)}`)
			.then(res => res.json())
			.then(res => {
				this.searching = false;
				this.results = res.results;
				this.noResults = this.results.length === 0;
			});
		}
	}
});

